Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff

                      + gridPos    = {
                          + h = 1
                          + w = 24
                          + x = 0
                          + y = 85
                        }
                      + panels     = []
                      + targets    = [
                          + {
                              + datasource = {
                                  + type = "datasource"
                                  + uid  = "grafana"
                                }
                              + refId      = "A"
                            },
                        ]
                      + title      = "Data Mover"
                      + type       = "row"
                    },
                  + {
                      + datasource    = {
                          + type = "prometheus"
                          + uid  = "${datasource}"
                        }
                      + fieldConfig   = {
                          + defaults  = {
                              + color      = {
                                  + mode = "palette-classic"
                                }
                              + custom     = {
                                  + axisBorderShow    = false
                                  + axisCenteredZero  = false
                                  + axisColorMode     = "text"
                                  + axisLabel         = ""
                                  + axisPlacement     = "auto"
                                  + barAlignment      = 0
                                  + drawStyle         = "line"
                                  + fillOpacity       = 100
                                  + gradientMode      = "none"
                                  + hideFrom          = {
                                      + legend  = false
                                      + tooltip = false
                                      + viz     = false
                                    }
                                  + insertNulls       = false
                                  + lineInterpolation = "stepAfter"
                                  + lineWidth         = 1
                                  + pointSize         = 5
                                  + scaleDistribution = {
                                      + type = "linear"
                                    }
                                  + showPoints        = "never"
                                  + spanNulls         = false
                                  + stacking          = {
                                      + group = "A"
                                      + mode  = "normal"
                                    }
                                  + thresholdsStyle   = {
                                      + mode = "off"
                                    }
                                }
                              + decimals   = 0
                              + links      = []
                              + mappings   = []
                              + thresholds = {
                                  + mode  = "absolute"
                                  + steps = [
                                      + {
                                          + color = "green"
                                          + value = null
                                        },
                                      + {
                                          + color = "red"
                                          + value = 80
                                        },
                                    ]
                                }
                              + unit       = "short"
                            }
                          + overrides = []
                        }
                      + gridPos       = {
                          + h = 9
                          + w = 24
                          + x = 0
                          + y = 86
                        }
                      + options       = {
                          + legend  = {
                              + calcs       = []
                              + displayMode = "list"
                              + placement   = "right"
                              + showLegend  = true
                            }
                          + tooltip = {
                              + mode = "multi"
                              + sort = "none"
                            }
                        }
                      + pluginVersion = "8.4.4"
                      + targets       = [
                          + {
                              + datasource   = {
                                  + type = "prometheus"
                                  + uid  = "${datasource}"
                                }
                              + exemplar     = false
                              + expr         = "round(sum(increase(podVolume_data_upload_success_total{node=~\"$fsb_node\"}[1h])))"
                              + format       = "time_series"
                              + instant      = false
                              + interval     = ""
                              + legendFormat = "Data upload success"
                              + refId        = "A"
                            },
                          + {
                              + datasource   = {
                                  + type = "prometheus"
                                  + uid  = "${datasource}"
                                }
                              + exemplar     = false
                              + expr         = "round(sum(increase(podVolume_data_upload_failure_total{node=~\"$fsb_node\"}[1h])))"
                              + hide         = false
                              + instant      = false
                              + interval     = ""
                              + legendFormat = "Data upload failure"
                              + refId        = "B"
                            },
                          + {
                              + datasource   = {
                                  + type = "prometheus"
                                  + uid  = "${datasource}"
                                }
                              + exemplar     = false
                              + expr         = "round(sum(increase(podVolume_data_upload_cancel_total{node=~\"$fsb_node\"}[1h])))"
                              + instant      = false
                              + interval     = ""
                              + legendFormat = "Data upload cancel"
                              + refId        = "C"
                            },
                          + {
                              + datasource   = {
                                  + type = "prometheus"
                                  + uid  = "${datasource}"
                                }
                              + exemplar     = false
                              + expr         = "round(sum(increase(podVolume_data_download_success_total{node=~\"$fsb_node\"}[1h])))"
                              + instant      = false
                              + interval     = ""
                              + legendFormat = "Data download success"
                              + refId        = "D"
                            },
                          + {
                              + datasource   = {
                                  + type = "prometheus"
                                  + uid  = "${datasource}"
                                }
                              + exemplar     = false
                              + expr         = "round(sum(increase(podVolume_data_download_failure_total{node=~\"$fsb_node\"}[1h])))"
                              + instant      = false
                              + interval     = ""
                              + legendFormat = "Data download failure"
                              + refId        = "E"
                            },
                          + {
                              + datasource   = {
                                  + type = "prometheus"
                                  + uid  = "${datasource}"
                                }
                              + exemplar     = true
                              + expr         = "round(sum(increase(podVolume_data_upload_cancel_total{node=~\"$fsb_node\"}[1h])))"
                              + hide         = false
                              + interval     = ""
                              + legendFormat = "Data download cancel"
                              + refId        = "F"
                            },
                        ]
                      + title         = "CSI Snapshot Data Mover per hour"
                      + type          = "timeseries"
                    },
                ]
              + refresh              = false
              + schemaVersion        = 39
              + tags                 = [
                  + "velero",
                ]
              + templating           = {
                  + list = [
                      + {
                          + current     = {
                              + selected = false
                              + text     = "grafanacloud-dfdsdemo-prom"
                              + value    = "grafanacloud-prom"
                            }
                          + hide        = 0
                          + includeAll  = false
                          + label       = "Datasource"
                          + multi       = false
                          + name        = "datasource"
                          + options     = []
                          + query       = "prometheus"
                          + queryValue  = ""
                          + refresh     = 1
                          + regex       = ""
                          + skipUrlSync = false
                          + type        = "datasource"
                        },
                      + {
                          + current        = {
                              + selected = false
                              + text     = "All"
                              + value    = "$__all"
                            }
                          + datasource     = {
                              + type = "prometheus"
                              + uid  = "$datasource"
                            }
                          + definition     = "label_values(velero_backup_attempt_total, schedule)"
                          + hide           = 0
                          + includeAll     = true
                          + multi          = true
                          + name           = "schedule"
                          + options        = []
                          + query          = {
                              + query = "label_values(velero_backup_attempt_total, schedule)"
                              + refId = "StandardVariableQuery"
                            }
                          + refresh        = 1
                          + regex          = ""
                          + skipUrlSync    = false
                          + sort           = 0
                          + tagValuesQuery = ""
                          + tagsQuery      = ""
                          + type           = "query"
                          + useTags        = false
                        },
                      + {
                          + current     = {
                              + selected = false
                              + text     = "All"
                              + value    = "$__all"
                            }
                          + datasource  = {
                              + type = "prometheus"
                              + uid  = "$datasource"
                            }
                          + definition  = "label_values(velero_csi_snapshot_attempt_total, backupName)"
                          + hide        = 0
                          + includeAll  = true
                          + multi       = false
                          + name        = "csi_backup_name"
                          + options     = []
                          + query       = {
                              + query = "label_values(velero_csi_snapshot_attempt_total, backupName)"
                              + refId = "StandardVariableQuery"
                            }
                          + refresh     = 1
                          + regex       = ""
                          + skipUrlSync = false
                          + sort        = 0
                          + type        = "query"
                        },
                      + {
                          + current     = {
                              + selected = false
                              + text     = "All"
                              + value    = "$__all"
                            }
                          + datasource  = {
                              + type = "prometheus"
                              + uid  = "$datasource"
                            }
                          + definition  = "label_values(restic_pod_volume_backup_enqueue_count, node)"
                          + hide        = 0
                          + includeAll  = true
                          + multi       = false
                          + name        = "restic_node"
                          + options     = []
                          + query       = {
                              + query = "label_values(restic_pod_volume_backup_enqueue_count, node)"
                              + refId = "StandardVariableQuery"
                            }
                          + refresh     = 1
                          + regex       = ""
                          + skipUrlSync = false
                          + sort        = 0
                          + type        = "query"
                        },
                      + {
                          + current     = {
                              + selected = false
                              + text     = "All"
                              + value    = "$__all"
                            }
                          + datasource  = {
                              + type = "prometheus"
                              + uid  = "$datasource"
                            }
                          + definition  = "label_values(restic_restic_operation_latency_seconds_gauge, backupName)"
                          + hide        = 0
                          + includeAll  = true
                          + multi       = false
                          + name        = "restic_backup_name"
                          + options     = []
                          + query       = {
                              + query = "label_values(restic_restic_operation_latency_seconds_gauge, backupName)"
                              + refId = "StandardVariableQuery"
                            }
                          + refresh     = 1
                          + regex       = ""
                          + skipUrlSync = false
                          + sort        = 0
                          + type        = "query"
                        },
                      + {
                          + current     = {
                              + selected = false
                              + text     = "All"
                              + value    = "$__all"
                            }
                          + datasource  = {
                              + type = "prometheus"
                              + uid  = "$datasource"
                            }
                          + definition  = "label_values(restic_restic_operation_latency_seconds_gauge, operation)"
                          + hide        = 0
                          + includeAll  = true
                          + multi       = false
                          + name        = "restic_operation"
                          + options     = []
                          + query       = {
                              + query = "label_values(restic_restic_operation_latency_seconds_gauge, operation)"
                              + refId = "StandardVariableQuery"
                            }
                          + refresh     = 1
                          + regex       = ""
                          + skipUrlSync = false
                          + sort        = 0
                          + type        = "query"
                        },
                      + {
                          + current     = {
                              + selected = false
                              + text     = "All"
                              + value    = "$__all"
                            }
                          + datasource  = {
                              + type = "prometheus"
                              + uid  = "$datasource"
                            }
                          + definition  = "label_values(restic_restic_operation_latency_seconds_gauge, pod_volume_backup)"
                          + hide        = 0
                          + includeAll  = true
                          + multi       = false
                          + name        = "restic_pvb_name"
                          + options     = []
                          + query       = {
                              + query = "label_values(restic_restic_operation_latency_seconds_gauge, pod_volume_backup)"
                              + refId = "StandardVariableQuery"
                            }
                          + refresh     = 1
                          + regex       = ""
                          + skipUrlSync = false
                          + sort        = 0
                          + type        = "query"
                        },
                      + {
                          + current     = {
                              + selected = false
                              + text     = "All"
                              + value    = "$__all"
                            }
                          + datasource  = {
                              + type = "datasource"
                              + uid  = "grafana"
                            }
                          + definition  = "label_values(podVolume_pod_volume_backup_enqueue_count, node)"
                          + hide        = 0
                          + includeAll  = true
                          + multi       = false
                          + name        = "fsb_node"
                          + options     = []
                          + query       = {
                              + query = "label_values(podVolume_pod_volume_backup_enqueue_count, node)"
                              + refId = "StandardVariableQuery"
                            }
                          + refresh     = 1
                          + regex       = ""
                          + skipUrlSync = false
                          + sort        = 0
                          + type        = "query"
                        },
                      + {
                          + current     = {
                              + selected = false
                              + text     = "All"
                              + value    = "$__all"
                            }
                          + datasource  = {
                              + type = "datasource"
                              + uid  = "grafana"
                            }
                          + definition  = "label_values(podVolume_pod_volume_operation_latency_seconds_gauge, backupName)"
                          + hide        = 0
                          + includeAll  = true
                          + multi       = false
                          + name        = "fsb_backup_name"
                          + options     = []
                          + query       = {
                              + query = "label_values(podVolume_pod_volume_operation_latency_seconds_gauge, backupName)"
                              + refId = "StandardVariableQuery"
                            }
                          + refresh     = 1
                          + regex       = ""
                          + skipUrlSync = false
                          + sort        = 0
                          + type        = "query"
                        },
                      + {
                          + current     = {
                              + selected = false
                              + text     = "All"
                              + value    = "$__all"
                            }
                          + datasource  = {
                              + type = "datasource"
                              + uid  = "grafana"
                            }
                          + definition  = "label_values(podVolume_pod_volume_operation_latency_seconds_gauge, operation)"
                          + hide        = 0
                          + includeAll  = true
                          + multi       = false
                          + name        = "fsb_operation"
                          + options     = []
                          + query       = {
                              + query = "label_values(podVolume_pod_volume_operation_latency_seconds_gauge, operation)"
                              + refId = "StandardVariableQuery"
                            }
                          + refresh     = 1
                          + regex       = ""
                          + skipUrlSync = false
                          + sort        = 0
                          + type        = "query"
                        },
                      + {
                          + current     = {
                              + selected = false
                              + text     = "All"
                              + value    = "$__all"
                            }
                          + datasource  = {
                              + type = "datasource"
                              + uid  = "grafana"
                            }
                          + definition  = "label_values(podVolume_pod_volume_operation_latency_seconds_gauge, pod_volume_backup)"
                          + hide        = 0
                          + includeAll  = true
                          + multi       = false
                          + name        = "fsb_pvb_name"
                          + options     = []
                          + query       = {
                              + query = "label_values(podVolume_pod_volume_operation_latency_seconds_gauge, pod_volume_backup)"
                              + refId = "StandardVariableQuery"
                            }
                          + refresh     = 1
                          + regex       = ""
                          + skipUrlSync = false
                          + sort        = 0
                          + type        = "query"
                        },
                    ]
                }
              + time                 = {
                  + from = "now-2d"
                  + to   = "now"
                }
              + timepicker           = {
                  + hidden            = false
                  + refresh_intervals = [
                      + "5s",
                      + "10s",
                      + "30s",
                      + "1m",
                      + "5m",
                      + "15m",
                      + "30m",
                      + "1h",
                      + "2h",
                      + "1d",
                    ]
                }
              + timezone             = ""
              + title                = "Kubernetes/Tanzu/Velero"
              + uid                  = "YAniUGC"
              + weekStart            = ""
            }
        )
      + dashboard_id = (known after apply)
      + folder       = (known after apply)
      + id           = (known after apply)
      + overwrite    = true
      + uid          = (known after apply)
      + url          = (known after apply)
      + version      = (known after apply)
    }

  # module.dashboards["enabled"].grafana_dashboard_permission.this["dashboards/1password-metrics.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards["enabled"].grafana_dashboard_permission.this["dashboards/1password-scimbridge.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards["enabled"].grafana_dashboard_permission.this["dashboards/aws-backup-metrics.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards["enabled"].grafana_dashboard_permission.this["dashboards/aws-cni-metrics.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards["enabled"].grafana_dashboard_permission.this["dashboards/aws-subnet-usage.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards["enabled"].grafana_dashboard_permission.this["dashboards/blueprints-rds-adoption.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards["enabled"].grafana_dashboard_permission.this["dashboards/cloud-engineering-adoption.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards["enabled"].grafana_dashboard_permission.this["dashboards/cluster-capacity.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards["enabled"].grafana_dashboard_permission.this["dashboards/cluster-health.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards["enabled"].grafana_dashboard_permission.this["dashboards/ec2-credits.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards["enabled"].grafana_dashboard_permission.this["dashboards/eks-version.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards["enabled"].grafana_dashboard_permission.this["dashboards/flux-cluster-stats.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards["enabled"].grafana_dashboard_permission.this["dashboards/flux-control-plane.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards["enabled"].grafana_dashboard_permission.this["dashboards/goldpinger.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards["enabled"].grafana_dashboard_permission.this["dashboards/helm-exporter.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards["enabled"].grafana_dashboard_permission.this["dashboards/kafka-exporter.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards["enabled"].grafana_dashboard_permission.this["dashboards/kiosk.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards["enabled"].grafana_dashboard_permission.this["dashboards/kubernetes-components.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards["enabled"].grafana_dashboard_permission.this["dashboards/liveness-readiness-for-namespace.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards["enabled"].grafana_dashboard_permission.this["dashboards/liveness-readiness.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards["enabled"].grafana_dashboard_permission.this["dashboards/node-condition.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards["enabled"].grafana_dashboard_permission.this["dashboards/node-sockets-used.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards["enabled"].grafana_dashboard_permission.this["dashboards/priorityclass.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards["enabled"].grafana_dashboard_permission.this["dashboards/prometheus-blackbox-exporter.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards["enabled"].grafana_dashboard_permission.this["dashboards/selfservice-adoption.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards["enabled"].grafana_dashboard_permission.this["dashboards/selfservice-rds-tagging-compliance.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards["enabled"].grafana_dashboard_permission.this["dashboards/traefik-blue-green.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards["enabled"].grafana_dashboard_permission.this["dashboards/traefik-integration.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.dashboards["enabled"].grafana_dashboard_permission.this["dashboards/velero.json"] will be created
  + resource "grafana_dashboard_permission" "this" {
      + dashboard_uid = (known after apply)
      + id            = (known after apply)

      + permissions {
          + permission = "Edit"
          + role       = "Editor"
          + team_id    = "0"
          + user_id    = "0"
        }
    }

  # module.grafana_data_source_aws_athena.grafana_data_source.athena["data_sources/aws_athena/athena-1password.json"] will be destroyed
  # (because module.grafana_data_source_aws_athena is not in configuration)
  - resource "grafana_data_source" "athena" {
      - access_mode        = "proxy" -> null
      - basic_auth_enabled = false -> null
      - id                 = "1:ddfcp482rkiyoe" -> null
      - is_default         = false -> null
      - json_data_encoded  = jsonencode(
            {
              - assumeRoleArn  = "arn:aws:iam::616912401663:role/1password_grafana_cloud_athena"
              - authType       = "grafana_assume_role"
              - catalog        = "AwsDataCatalog"
              - database       = "1password"
              - defaultRegion  = "eu-central-1"
              - outputLocation = "s3://dfds-1password-collected-metrics-store/athena"
              - workgroup      = "primary"
            }
        ) -> null
      - name               = "Athena-1Password" -> null
      - org_id             = "1" -> null
      - type               = "grafana-athena-datasource" -> null
      - uid                = "ddfcp482rkiyoe" -> null
    }

  # module.grafana_data_source_aws_athena.grafana_data_source.athena["data_sources/aws_athena/athena-aws-backup.json"] will be destroyed
  # (because module.grafana_data_source_aws_athena is not in configuration)
  - resource "grafana_data_source" "athena" {
      - access_mode        = "proxy" -> null
      - basic_auth_enabled = false -> null
      - id                 = "1:cdj0a5m7tqtc0a" -> null
      - is_default         = false -> null
      - json_data_encoded  = jsonencode(
            {
              - assumeRoleArn  = "arn:aws:iam::080206698049:role/aws-backup-dashboards_grafana_cloud_athena"
              - authType       = "grafana_assume_role"
              - catalog        = "AwsDataCatalog"
              - database       = "awsbackupobservability"
              - defaultRegion  = "eu-central-1"
              - outputLocation = "s3://aws-backup-dashboards/athena"
              - workgroup      = "primary"
            }
        ) -> null
      - name               = "Athena-AWS-Backup" -> null
      - org_id             = "1" -> null
      - type               = "grafana-athena-datasource" -> null
      - uid                = "cdj0a5m7tqtc0a" -> null
    }

  # module.grafana_data_source_aws_athena.grafana_data_source.athena["data_sources/aws_athena/athena-iam-roles-anywhere.json"] will be destroyed
  # (because module.grafana_data_source_aws_athena is not in configuration)
  - resource "grafana_data_source" "athena" {
      - access_mode        = "proxy" -> null
      - basic_auth_enabled = false -> null
      - id                 = "1:edrbwyhrnpm9sb" -> null
      - is_default         = false -> null
      - json_data_encoded  = jsonencode(
            {
              - assumeRoleArn  = "arn:aws:iam::303242044692:role/grafana-cloud-observability"
              - authType       = "grafana_assume_role"
              - catalog        = "iam-rolesanywhere-pca-observability"
              - database       = "iam_rolesanywhere_pca_observability"
              - defaultRegion  = "eu-central-1"
              - outputLocation = "s3://dfds-iam-rolesanywhere-pca-observability-athena"
              - workgroup      = "iam-rolesanywhere-pca-observability"
            }
        ) -> null
      - name               = "Athena-IAM-roles-anywhere" -> null
      - org_id             = "1" -> null
      - type               = "grafana-athena-datasource" -> null
      - uid                = "edrbwyhrnpm9sb" -> null
    }

  # module.grafana_data_source_aws_athena["enabled"].grafana_data_source.athena["data_sources/aws_athena/athena-1password.json"] will be created
  + resource "grafana_data_source" "athena" {
      + access_mode        = "proxy"
      + basic_auth_enabled = false
      + id                 = (known after apply)
      + is_default         = false
      + json_data_encoded  = jsonencode(
            {
              + assumeRoleArn  = "arn:aws:iam::616912401663:role/1password_grafana_cloud_athena"
              + authType       = "grafana_assume_role"
              + catalog        = "AwsDataCatalog"
              + database       = "1password"
              + defaultRegion  = "eu-central-1"
              + outputLocation = "s3://dfds-1password-collected-metrics-store/athena"
              + workgroup      = "primary"
            }
        )
      + name               = "Athena-1Password"
      + type               = "grafana-athena-datasource"
      + uid                = (known after apply)
    }

  # module.grafana_data_source_aws_athena["enabled"].grafana_data_source.athena["data_sources/aws_athena/athena-aws-backup.json"] will be created
  + resource "grafana_data_source" "athena" {
      + access_mode        = "proxy"
      + basic_auth_enabled = false
      + id                 = (known after apply)
      + is_default         = false
      + json_data_encoded  = jsonencode(
            {
              + assumeRoleArn  = "arn:aws:iam::080206698049:role/aws-backup-dashboards_grafana_cloud_athena"
              + authType       = "grafana_assume_role"
              + catalog        = "AwsDataCatalog"
              + database       = "awsbackupobservability"
              + defaultRegion  = "eu-central-1"
              + outputLocation = "s3://aws-backup-dashboards/athena"
              + workgroup      = "primary"
            }
        )
      + name               = "Athena-AWS-Backup"
      + type               = "grafana-athena-datasource"
      + uid                = (known after apply)
    }

  # module.grafana_data_source_aws_athena["enabled"].grafana_data_source.athena["data_sources/aws_athena/athena-iam-roles-anywhere.json"] will be created
  + resource "grafana_data_source" "athena" {
      + access_mode        = "proxy"
      + basic_auth_enabled = false
      + id                 = (known after apply)
      + is_default         = false
      + json_data_encoded  = jsonencode(
            {
              + assumeRoleArn  = "arn:aws:iam::303242044692:role/grafana-cloud-observability"
              + authType       = "grafana_assume_role"
              + catalog        = "iam-rolesanywhere-pca-observability"
              + database       = "iam_rolesanywhere_pca_observability"
              + defaultRegion  = "eu-central-1"
              + outputLocation = "s3://dfds-iam-rolesanywhere-pca-observability-athena"
              + workgroup      = "iam-rolesanywhere-pca-observability"
            }
        )
      + name               = "Athena-IAM-roles-anywhere"
      + type               = "grafana-athena-datasource"
      + uid                = (known after apply)
    }

  # module.grafana_data_source_aws_cloudwatch.grafana_data_source.cloudwatch["data_sources/aws_cloudwatch/cloudwatch-iam-roles-anywhere-pca-prod-eu-central-1.json"] will be destroyed
  # (because module.grafana_data_source_aws_cloudwatch is not in configuration)
  - resource "grafana_data_source" "cloudwatch" {
      - access_mode        = "proxy" -> null
      - basic_auth_enabled = false -> null
      - id                 = "1:fdrtfy9dhcm4gd" -> null
      - is_default         = false -> null
      - json_data_encoded  = jsonencode(
            {
              - assumeRoleArn = "arn:aws:iam::563532571036:role/grafana-cloud-cloudwatch-integration"
              - authType      = "grafana_assume_role"
              - defaultRegion = "eu-central-1"
            }
        ) -> null
      - name               = "CloudWatch-iam-roles-anywhere-pca-prod-eu-central-1" -> null
      - org_id             = "1" -> null
      - type               = "cloudwatch" -> null
      - uid                = "fdrtfy9dhcm4gd" -> null
    }

  # module.grafana_data_source_aws_cloudwatch.grafana_data_source.cloudwatch["data_sources/aws_cloudwatch/cloudwatch-iam-roles-anywhere-pca-test-eu-central-1.json"] will be destroyed
  # (because module.grafana_data_source_aws_cloudwatch is not in configuration)
  - resource "grafana_data_source" "cloudwatch" {
      - access_mode        = "proxy" -> null
      - basic_auth_enabled = false -> null
      - id                 = "1:edrtfy9d4v4e8e" -> null
      - is_default         = false -> null
      - json_data_encoded  = jsonencode(
            {
              - assumeRoleArn = "arn:aws:iam::381922248812:role/grafana-cloud-cloudwatch-integration"
              - authType      = "grafana_assume_role"
              - defaultRegion = "eu-central-1"
            }
        ) -> null
      - name               = "CloudWatch-iam-roles-anywhere-pca-test-eu-central-1" -> null
      - org_id             = "1" -> null
      - type               = "cloudwatch" -> null
      - uid                = "edrtfy9d4v4e8e" -> null
    }

  # module.grafana_data_source_aws_cloudwatch.grafana_data_source.cloudwatch["data_sources/aws_cloudwatch/cloudwatch-oxygen-eu-west-1.json"] will be destroyed
  # (because module.grafana_data_source_aws_cloudwatch is not in configuration)
  - resource "grafana_data_source" "cloudwatch" {
      - access_mode        = "proxy" -> null
      - basic_auth_enabled = false -> null
      - id                 = "1:fdey90cd04a2oa" -> null
      - is_default         = false -> null
      - json_data_encoded  = jsonencode(
            {
              - assumeRoleArn = "arn:aws:iam::738063116313:role/grafana-cloud-cloudwatch-integration"
              - authType      = "grafana_assume_role"
              - defaultRegion = "eu-west-1"
            }
        ) -> null
      - name               = "CloudWatch-oxygen-eu-west-1" -> null
      - org_id             = "1" -> null
      - type               = "cloudwatch" -> null
      - uid                = "fdey90cd04a2oa" -> null
    }

  # module.grafana_data_source_aws_cloudwatch["enabled"].grafana_data_source.cloudwatch["data_sources/aws_cloudwatch/cloudwatch-iam-roles-anywhere-pca-prod-eu-central-1.json"] will be created
  + resource "grafana_data_source" "cloudwatch" {
      + access_mode        = "proxy"
      + basic_auth_enabled = false
      + id                 = (known after apply)
      + is_default         = false
      + json_data_encoded  = jsonencode(
            {
              + assumeRoleArn = "arn:aws:iam::563532571036:role/grafana-cloud-cloudwatch-integration"
              + authType      = "grafana_assume_role"
              + defaultRegion = "eu-central-1"
            }
        )
      + name               = "CloudWatch-iam-roles-anywhere-pca-prod-eu-central-1"
      + type               = "cloudwatch"
      + uid                = (known after apply)
    }

  # module.grafana_data_source_aws_cloudwatch["enabled"].grafana_data_source.cloudwatch["data_sources/aws_cloudwatch/cloudwatch-iam-roles-anywhere-pca-test-eu-central-1.json"] will be created
  + resource "grafana_data_source" "cloudwatch" {
      + access_mode        = "proxy"
      + basic_auth_enabled = false
      + id                 = (known after apply)
      + is_default         = false
      + json_data_encoded  = jsonencode(
            {
              + assumeRoleArn = "arn:aws:iam::381922248812:role/grafana-cloud-cloudwatch-integration"
              + authType      = "grafana_assume_role"
              + defaultRegion = "eu-central-1"
            }
        )
      + name               = "CloudWatch-iam-roles-anywhere-pca-test-eu-central-1"
      + type               = "cloudwatch"
      + uid                = (known after apply)
    }

  # module.grafana_data_source_aws_cloudwatch["enabled"].grafana_data_source.cloudwatch["data_sources/aws_cloudwatch/cloudwatch-oxygen-eu-west-1.json"] will be created
  + resource "grafana_data_source" "cloudwatch" {
      + access_mode        = "proxy"
      + basic_auth_enabled = false
      + id                 = (known after apply)
      + is_default         = false
      + json_data_encoded  = jsonencode(
            {
              + assumeRoleArn = "arn:aws:iam::738063116313:role/grafana-cloud-cloudwatch-integration"
              + authType      = "grafana_assume_role"
              + defaultRegion = "eu-west-1"
            }
        )
      + name               = "CloudWatch-oxygen-eu-west-1"
      + type               = "cloudwatch"
      + uid                = (known after apply)
    }

  # module.grafana_notification.grafana_contact_point.this[0] will be destroyed
  # (because module.grafana_notification is not in configuration)
  - resource "grafana_contact_point" "this" {
      - disable_provenance = false -> null
      - id                 = "0:Cloud Engineering Slack" -> null
      - name               = "Cloud Engineering Slack" -> null
      - org_id             = "0" -> null

      - slack {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.grafana_notification.grafana_notification_policy.this[0] will be destroyed
  # (because module.grafana_notification is not in configuration)
  - resource "grafana_notification_policy" "this" {
      - contact_point      = "grafana-default-email" -> null
      - disable_provenance = true -> null
      - group_by           = [
          - "...",
        ] -> null
      - group_interval     = "5m" -> null
      - group_wait         = "30s" -> null
      - id                 = "0:policy" -> null
      - org_id             = "0" -> null
      - repeat_interval    = "4h" -> null

      - policy {
          - contact_point = "Cloud Engineering Slack" -> null
          - continue      = false -> null
          - group_by      = [
              - "grafana_folder",
            ] -> null
          - mute_timings  = [] -> null

          - matcher {
              - label = "grafana_folder" -> null
              - match = "=" -> null
              - value = "Cloud Engineering" -> null
            }

          - policy {
              - continue        = false -> null
              - group_by        = [
                  - "grafana_folder",
                  - "alertname",
                ] -> null
              - mute_timings    = [] -> null
              - repeat_interval = "1d" -> null

              - matcher {
                  - label = "repeat" -> null
                  - match = "=" -> null
                  - value = "24h" -> null
                }
            }
        }
    }

Plan: 66 to add, 0 to change, 98 to destroy.
time=2024-08-15T07:16:30Z level=info msg=Encountered an error eligible for retrying. Sleeping 5s before retrying.
 prefix=[/atlantis-data/repos/dfds/grafana-cloud-objects/86/grafana-cloud-objects-demo-ws-01/environments/demo] 
module.ce_folder.random_uuid.this: Refreshing state... [id=b934e728-bb75-170b-83e7-024c5bdd6e61]
data.aws_ssm_parameter.grafana_sa_access_token: Reading...
data.aws_ssm_parameter.grafana_url: Reading...
data.aws_ssm_parameter.grafana_url: Read complete after 0s [id=/grafana-cloud/demo/stack-url]
data.aws_ssm_parameter.grafana_sa_access_token: Read complete after 0s [id=/grafana-cloud/demo/terraform-sa-access-token]
module.ce_folder.grafana_folder.this: Refreshing state... [id=0:b934e728-bb75-170b-83e7-024c5bdd6e61]
module.grafana_data_source_aws_cloudwatch.grafana_data_source.cloudwatch["data_sources/aws_cloudwatch/cloudwatch-oxygen-eu-west-1.json"]: Refreshing state... [id=1:fdey90cd04a2oa]
module.grafana_data_source_aws_cloudwatch.grafana_data_source.cloudwatch["data_sources/aws_cloudwatch/cloudwatch-iam-roles-anywhere-pca-test-eu-central-1.json"]: Refreshing state... [id=1:edrtfy9d4v4e8e]
module.grafana_data_source_aws_cloudwatch.grafana_data_source.cloudwatch["data_sources/aws_cloudwatch/cloudwatch-iam-roles-anywhere-pca-prod-eu-central-1.json"]: Refreshing state... [id=1:fdrtfy9dhcm4gd]
module.grafana_data_source_aws_athena.grafana_data_source.athena["data_sources/aws_athena/athena-1password.json"]: Refreshing state... [id=1:ddfcp482rkiyoe]
module.grafana_notification.grafana_contact_point.this[0]: Refreshing state... [id=0:Cloud Engineering Slack]
module.grafana_data_source_aws_athena.grafana_data_source.athena["data_sources/aws_athena/athena-aws-backup.json"]: Refreshing state... [id=1:cdj0a5m7tqtc0a]
module.grafana_data_source_aws_athena.grafana_data_source.athena["data_sources/aws_athena/athena-iam-roles-anywhere.json"]: Refreshing state... [id=1:edrbwyhrnpm9sb]
module.grafana_notification.grafana_notification_policy.this[0]: Refreshing state... [id=0:policy]
module.alerts.grafana_rule_group.alertrule["alertrules/Kafka-exporter up alert.json"]: Refreshing state... [id=0:b934e728-bb75-170b-83e7-024c5bdd6e61:Kafka-exporter up alert]
module.alerts.grafana_rule_group.alertrule["alertrules/Topic has large amount of consumergroups.json"]: Refreshing state... [id=0:b934e728-bb75-170b-83e7-024c5bdd6e61:Topic has large amount of consumergroups]
module.alerts.grafana_rule_group.alertrule["alertrules/Failed Restore Counts alert.json"]: Refreshing state... [id=0:b934e728-bb75-170b-83e7-024c5bdd6e61:Failed Restore Counts alert]
module.alerts.grafana_rule_group.alertrule["alertrules/Watchdog.json"]: Refreshing state... [id=0:b934e728-bb75-170b-83e7-024c5bdd6e61:Watchdog]
module.alerts.grafana_rule_group.alertrule["alertrules/Blackbox probe target is down.json"]: Refreshing state... [id=0:b934e728-bb75-170b-83e7-024c5bdd6e61:Blackbox probe target is down]
module.alerts.grafana_rule_group.alertrule["alertrules/Memory Capacity Utilization Alert.json"]: Refreshing state... [id=1:b934e728-bb75-170b-83e7-024c5bdd6e61:Memory Capacity Utilization Alert]
module.alerts.grafana_rule_group.alertrule["alertrules/EC2 Worker Node Credit Balance alert.json"]: Refreshing state... [id=1:b934e728-bb75-170b-83e7-024c5bdd6e61:EC2 Worker Node Credit Balance alert]
module.alerts.grafana_rule_group.alertrule["alertrules/Nodes by state alert.json"]: Refreshing state... [id=0:b934e728-bb75-170b-83e7-024c5bdd6e61:Nodes by state alert]
module.alerts.grafana_rule_group.alertrule["alertrules/API server 5xx errors alert.json"]: Refreshing state... [id=0:b934e728-bb75-170b-83e7-024c5bdd6e61:API server 5xx errors alert]
module.alerts.grafana_rule_group.alertrule["alertrules/Backup Validation Failure alert.json"]: Refreshing state... [id=0:b934e728-bb75-170b-83e7-024c5bdd6e61:Backup Validation Failure alert]
module.alerts.grafana_rule_group.alertrule["alertrules/Is cluster version past EOL.json"]: Refreshing state... [id=0:b934e728-bb75-170b-83e7-024c5bdd6e61:Is cluster version past EOL]
module.alerts.grafana_rule_group.alertrule["alertrules/Kube-Proxy unavailable alert.json"]: Refreshing state... [id=0:b934e728-bb75-170b-83e7-024c5bdd6e61:Kube-Proxy unavailable alert]
module.alerts.grafana_rule_group.alertrule["alertrules/Subnet IP usage alert.json"]: Refreshing state... [id=0:b934e728-bb75-170b-83e7-024c5bdd6e61:Subnet IP usage alert]
module.alerts.grafana_rule_group.alertrule["alertrules/Fluentd  daemonset running timeseries alert.json"]: Refreshing state... [id=0:b934e728-bb75-170b-83e7-024c5bdd6e61:Fluentd  daemonset running timeseries alert]
module.alerts.grafana_rule_group.alertrule["alertrules/VPC CNI unavailable alert.json"]: Refreshing state... [id=0:b934e728-bb75-170b-83e7-024c5bdd6e61:VPC CNI unavailable alert]
module.alerts.grafana_rule_group.alertrule["alertrules/NodeNotReady.json"]: Refreshing state... [id=0:b934e728-bb75-170b-83e7-024c5bdd6e61:NodeNotReady]
module.alerts.grafana_rule_group.alertrule["alertrules/CPU Capacity Utilization Alert.json"]: Refreshing state... [id=1:b934e728-bb75-170b-83e7-024c5bdd6e61:CPU Capacity Utilization Alert]
module.alerts.grafana_rule_group.alertrule["alertrules/Sockets used per node alert.json"]: Refreshing state... [id=0:b934e728-bb75-170b-83e7-024c5bdd6e61:Sockets used per node alert]
module.alerts.grafana_rule_group.alertrule["alertrules/CoreDNS unavailable alert.json"]: Refreshing state... [id=0:b934e728-bb75-170b-83e7-024c5bdd6e61:CoreDNS unavailable alert]
module.alerts.grafana_rule_group.alertrule["alertrules/SSL expiry alert.json"]: Refreshing state... [id=0:b934e728-bb75-170b-83e7-024c5bdd6e61:SSL expiry alert]
module.alerts.grafana_rule_group.alertrule["alertrules/Restore Validation Failure alert.json"]: Refreshing state... [id=0:b934e728-bb75-170b-83e7-024c5bdd6e61:Restore Validation Failure alert]
module.alerts.grafana_rule_group.alertrule["alertrules/Goldpinger.json"]: Refreshing state... [id=0:b934e728-bb75-170b-83e7-024c5bdd6e61:Goldpinger alert]
module.alerts.grafana_rule_group.alertrule["alertrules/Priority Classes alert.json"]: Refreshing state... [id=1:b934e728-bb75-170b-83e7-024c5bdd6e61:Priority Classes alert]
module.alerts.grafana_rule_group.alertrule["alertrules/Volume Snapshot Failure alert.json"]: Refreshing state... [id=0:b934e728-bb75-170b-83e7-024c5bdd6e61:Volume Snapshot Failure alert]
module.alerts.grafana_rule_group.alertrule["alertrules/Container Restarts (5m) alert.json"]: Refreshing state... [id=0:b934e728-bb75-170b-83e7-024c5bdd6e61:Container Restarts (5m) alert]
module.alerts.grafana_rule_group.alertrule["alertrules/Misuse of priority classes.json"]: Refreshing state... [id=0:b934e728-bb75-170b-83e7-024c5bdd6e61:Misuse of priority classes]
module.alerts.grafana_rule_group.alertrule["alertrules/Fluentd available buffer space ratio alert.json"]: Refreshing state... [id=0:b934e728-bb75-170b-83e7-024c5bdd6e61:Fluentd available buffer space ratio alert]
module.alerts.grafana_rule_group.alertrule["alertrules/Version alerts alert.json"]: Refreshing state... [id=0:b934e728-bb75-170b-83e7-024c5bdd6e61:Version alerts alert]
module.alerts.grafana_rule_group.alertrule["alertrules/Components version bump alerts alert.json"]: Refreshing state... [id=0:b934e728-bb75-170b-83e7-024c5bdd6e61:Components version bump alerts alert]
module.alerts.grafana_rule_group.alertrule["alertrules/Pod Capacity Utilization Alert.json"]: Refreshing state... [id=0:b934e728-bb75-170b-83e7-024c5bdd6e61:Pod Capacity Utilization Alert]
module.dashboards.grafana_dashboard.this["dashboards/traefik-integration.json"]: Refreshing state... [id=0:qPdAviJmz]
module.dashboards.grafana_dashboard.this["dashboards/priorityclass.json"]: Refreshing state... [id=0:W8nct6zGz]
module.dashboards.grafana_dashboard.this["dashboards/kubernetes-components.json"]: Refreshing state... [id=0:bj5-ZEhWk]
module.dashboards.grafana_dashboard.this["dashboards/kiosk.json"]: Refreshing state... [id=0:b8e019c1-27b7-4e4b-b880-28da9911f046]
module.dashboards.grafana_dashboard.this["dashboards/aws-backup-metrics.json"]: Refreshing state... [id=0:aws_backup_metrics]
module.dashboards.grafana_dashboard.this["dashboards/ec2-credits.json"]: Refreshing state... [id=0:GUakfOpMk]
module.dashboards.grafana_dashboard.this["dashboards/liveness-readiness-for-namespace.json"]: Refreshing state... [id=0:ca866f47-2789-471f-ae87-72a3e701b68a]
module.dashboards.grafana_dashboard.this["dashboards/aws-cni-metrics.json"]: Refreshing state... [id=0:aws-cni-metrics]
module.dashboards.grafana_dashboard.this["dashboards/eks-version.json"]: Refreshing state... [id=0:YMBzktpGzs]
module.dashboards.grafana_dashboard.this["dashboards/prometheus-blackbox-exporter.json"]: Refreshing state... [id=0:bXDq_ZNnz]
module.dashboards.grafana_dashboard.this["dashboards/cluster-capacity.json"]: Refreshing state... [id=0:s_zMzas4z]
module.dashboards.grafana_dashboard.this["dashboards/selfservice-adoption.json"]: Refreshing state... [id=0:c9f3f4c0-454f-49df-90e3-93a13d25ce4b]
module.dashboards.grafana_dashboard.this["dashboards/selfservice-rds-tagging-compliance.json"]: Refreshing state... [id=0:d032a367-82af-425a-8d05-c1e5395aeee3]
module.dashboards.grafana_dashboard.this["dashboards/flux-control-plane.json"]: Refreshing state... [id=0:flux-control-plane]
module.dashboards.grafana_dashboard.this["dashboards/goldpinger.json"]: Refreshing state... [id=0:D4EyPQTWk]
module.dashboards.grafana_dashboard.this["dashboards/aws-subnet-usage.json"]: Refreshing state... [id=0:1NxY8ypGk]
module.dashboards.grafana_dashboard.this["dashboards/node-condition.json"]: Refreshing state... [id=0:KbpocXAVk]
module.dashboards.grafana_dashboard.this["dashboards/helm-exporter.json"]: Refreshing state... [id=0:Gqncyvfmz]
module.dashboards.grafana_dashboard.this["dashboards/1password-scimbridge.json"]: Refreshing state... [id=0:scimbridge_prod]
module.dashboards.grafana_dashboard.this["dashboards/flux-cluster-stats.json"]: Refreshing state... [id=0:flux-cluster]
module.dashboards.grafana_dashboard.this["dashboards/liveness-readiness.json"]: Refreshing state... [id=0:ad9f701f-2796-43d2-bbf9-5ff1002118e9]
module.dashboards.grafana_dashboard.this["dashboards/blueprints-rds-adoption.json"]: Refreshing state... [id=0:a9c79f60-fdde-4e66-9009-b3863c3e0eda]
module.dashboards.grafana_dashboard.this["dashboards/1password-metrics.json"]: Refreshing state... [id=0:1password_metrics_adoption]
module.dashboards.grafana_dashboard.this["dashboards/cluster-health.json"]: Refreshing state... [id=0:4IxKHWtMz]
module.dashboards.grafana_dashboard.this["dashboards/traefik-blue-green.json"]: Refreshing state... [id=0:jGlZuY0Vk]
module.dashboards.grafana_dashboard.this["dashboards/cloud-engineering-adoption.json"]: Refreshing state... [id=0:axdphXDZz]
module.dashboards.grafana_dashboard.this["dashboards/node-sockets-used.json"]: Refreshing state... [id=0:GGodmXAVz]
module.dashboards.grafana_dashboard.this["dashboards/velero.json"]: Refreshing state... [id=0:YAniUGC]
module.dashboards.grafana_dashboard.this["dashboards/kafka-exporter.json"]: Refreshing state... [id=0:CoYn_3-nk]
module.dashboards.grafana_dashboard_permission.this["dashboards/cluster-capacity.json"]: Refreshing state... [id=0:s_zMzas4z]
module.dashboards.grafana_dashboard_permission.this["dashboards/blueprints-rds-adoption.json"]: Refreshing state... [id=0:a9c79f60-fdde-4e66-9009-b3863c3e0eda]
module.dashboards.grafana_dashboard_permission.this["dashboards/kubernetes-components.json"]: Refreshing state... [id=0:bj5-ZEhWk]
module.dashboards.grafana_dashboard_permission.this["dashboards/node-sockets-used.json"]: Refreshing state... [id=0:GGodmXAVz]
module.dashboards.grafana_dashboard_permission.this["dashboards/selfservice-rds-tagging-compliance.json"]: Refreshing state... [id=0:d032a367-82af-425a-8d05-c1e5395aeee3]
module.dashboards.grafana_dashboard_permission.this["dashboards/node-condition.json"]: Refreshing state... [id=0:KbpocXAVk]
module.dashboards.grafana_dashboard_permission.this["dashboards/liveness-readiness-for-namespace.json"]: Refreshing state... [id=0:ca866f47-2789-471f-ae87-72a3e701b68a]
module.dashboards.grafana_dashboard_permission.this["dashboards/ec2-credits.json"]: Refreshing state... [id=0:GUakfOpMk]
module.dashboards.grafana_dashboard_permission.this["dashboards/velero.json"]: Refreshing state... [id=0:YAniUGC]
module.dashboards.grafana_dashboard_permission.this["dashboards/aws-subnet-usage.json"]: Refreshing state... [id=0:1NxY8ypGk]
module.dashboards.grafana_dashboard_permission.this["dashboards/1password-scimbridge.json"]: Refreshing state... [id=0:scimbridge_prod]
module.dashboards.grafana_dashboard_permission.this["dashboards/priorityclass.json"]: Refreshing state... [id=0:W8nct6zGz]
module.dashboards.grafana_dashboard_permission.this["dashboards/eks-version.json"]: Refreshing state... [id=0:YMBzktpGzs]
module.dashboards.grafana_dashboard_permission.this["dashboards/goldpinger.json"]: Refreshing state... [id=0:D4EyPQTWk]
module.dashboards.grafana_dashboard_permission.this["dashboards/flux-control-plane.json"]: Refreshing state... [id=0:flux-control-plane]
module.dashboards.grafana_dashboard_permission.this["dashboards/cloud-engineering-adoption.json"]: Refreshing state... [id=0:axdphXDZz]
module.dashboards.grafana_dashboard_permission.this["dashboards/1password-metrics.json"]: Refreshing state... [id=0:1password_metrics_adoption]
module.dashboards.grafana_dashboard_permission.this["dashboards/liveness-readiness.json"]: Refreshing state... [id=0:ad9f701f-2796-43d2-bbf9-5ff1002118e9]
module.dashboards.grafana_dashboard_permission.this["dashboards/helm-exporter.json"]: Refreshing state... [id=0:Gqncyvfmz]
module.dashboards.grafana_dashboard_permission.this["dashboards/prometheus-blackbox-exporter.json"]: Refreshing state... [id=0:bXDq_ZNnz]
module.dashboards.grafana_dashboard_permission.this["dashboards/aws-cni-metrics.json"]: Refreshing state... [id=0:aws-cni-metrics]
module.dashboards.grafana_dashboard_permission.this["dashboards/flux-cluster-stats.json"]: Refreshing state... [id=0:flux-cluster]
module.dashboards.grafana_dashboard_permission.this["dashboards/cluster-health.json"]: Refreshing state... [id=0:4IxK
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.